app/controllers/species_controller.rb

SELECT  "species".* FROM "species"  ORDER BY "species"."id" DESC LIMIT 1
---
  def index
    @specieses = Species.all

INSERT INTO "species" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Basset"], ["created_at", "2016-02-26 22:43:33.267396"], ["updated_at", "2016-02-26 22:43:33.267396"]]
---
  def create
    @basset = Species.new
    @basset.name = params[:animal_name]
    @basset.save